
//
//  UserProtocolVC.m
//  CommentFrame
//
//  Created by warron on 2018/1/27.
//  Copyright © 2018年 warron. All rights reserved.
//

#import "UserProtocolVC.h"
#define  UserProtocolUseContent @"用户须知：在此特别提醒各位用户认真阅读、充分理解本《新易陶用户使用协议》（下称《协议》）——用户应认真阅读充分理解本《协议》中各条款。您的安装、使用、获取和登录新易陶等行为将视为对本《协议》的接受，并同意接受本《协议》各项条款的约束。本《协议》是您（下称“用户”）与公司之间关于用户安装、使用软件，注册、使用、管理软件；以及使用公司公司提供的相关服务所订立的协议。本《协议》描述公司与用户之间关于“软件”许可使用及服务相关方面的权利义务。“用户”是指通过公司提供的获取软件授权和新易陶注册的途径获得软件产品及号码授权许可以及使用公司公司提供的相关服务的个人或组织。本《协议》可由公司随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知。用户可重新下载安装本软件或网站查阅最新版协议条款。在公司修改《协议》条款后，如果用户不接受修改后的条款，请立即停止使用公司提供的软件和服务，用户继续使用公司提供的软件和服务将被视为已接受了修改后的协议。 除本《协议》有明确规定外，本《协议》并未对利用本“软件”使用的公司或合作单位的其他服务规定相关的服务条款。对于这些服务，一般有单独的服务条款加以规范，用户须在使用有关服务时另行了解与确认。单独的服务条款与本协议有冲突的地方，以单独的服务条款为准。如用户使用该服务，视为对相关服务条款的接受。\n1.知识产权声明本“软件”是由新易陶公司开发。“软件”的一切版权、商标权、专利权、商业秘密等知识产权，以及与“软件”相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、或电子文档等均受中华人民共和国著作权法、商标法、专利法、反不正当竞争法和相应的国际条约以及其他知识产权法律法规的保护，除涉及第三方授权的软件或技术外，公司享有上述知识产权。\n2.\n2.1 保留权利：未明示授权的其他一切权利仍归公司所有，用户使用其他权利时须另外取得公司的书面同意。\n2.2 除本《协议》有明确规定外， 本《协议》并未对利用本软件访问的公司或合作单位的其他服务规定相关的服务条款，对于这些服务有可能有单独的服务条款加以规范，请用户在使用有关服务时另行了解与确认。\n3. 法律责任与免责\n3.1 公司特别提请用户注意：公司为了保障公司业务发展和调整的自主权，公司拥有随时自行修改或中断软件授权而不需通知用户的权利，如有必要，修改或中断会以通告形式公布于公司网站重要页面上。\n3.2 用户违反本《协议》或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户同意赔偿公司与合作公司、关联公司，并使之免受损害。\n3.3 使用本“软件”由用户自己承担风险，公司及合作单位对本“软件”不作任何类型的担保，不论是明示的、默示的或法令的保证和条件，包括但不限于本“软件”的适销性、适用性、无病毒、无疏忽或无技术瑕疵问题、所有权和无侵权的明示或默示担保和条件，对在任何情况下因使用或不能使用本“软件”所产生的直接、间接、偶然、特殊及后续的损害及风险，公司及合作单位不承担任何责任。\n3.3 使用本“软件”涉及到互联网服务，可能会受到各个环节不稳定因素的影响，存在因不可抗力、计算机病毒、黑客攻击、系统不稳定、非法内容信息、骚扰信息屏蔽以及其他任何网络、技术、通信线路、信息安全管理措施等原因造成的用户的经济损失，公司及合作单位不承担任何责任。\n3.4 用户因第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而遭受的一切损失，公司及合作单位不承担责任。\n3.5 因技术故障等不可抗事件影响到服务的正常运行的，公司及合作单位承诺在第一时间内与相关单位配合，及时处理进行修复，但用户因此而遭受的一切损失，公司及合作单位不承担责任。\n4. 其他条款\n4.1 本《协议》所定的任何条款的部分或全部无效者，不影响其它条款的效力。\n4.2 本《协议》的解释、效力及纠纷的解决，适用于中华人民共和国法律。\n4.3 本《协议》版权由公司所有，公司保留一切解释权利。本文中提及的软件和服务名称有可能为公司的注册商标或商标，受法律保护。\n5.特别声明：苹果公司不参与任何形式的奖励，抽奖等活动"
#define  ProtocolTypePrivacyContent @"新易陶app尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，新易陶app会按照本隐私权政策的规定使用和披露您的个人信息。但新易陶app将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，新易陶app不会将这些信息对外披露或向第三方提供。新易陶app会不时更新本隐私权政策。您在同意新易陶app服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于新易陶app服务使用协议不可分割的一部分。\n1. 适用范围\na) 在您使用新易陶app网络服务，或访问新易陶app平台网页时，新易陶app自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；\nb) 新易陶app通过合法途径从商业伙伴处取得的用户个人数据。\n2. 信息使用\na) 新易陶app不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和新易陶app（含新易陶app关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。\nb) 新易陶app亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何新易陶app平台用户如从事上述活动，一经发现，我司有权立即终止与该用户的服务协议。 \nc) 为服务用户的目的，新易陶app可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与我司合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。\n 3. 信息披露在如下情况下，新易陶app将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：\n a) 经您事先同意，向第三方披露；b) 为提供您所要求的产品和服务，而必须和第三方分享您的个人信息； c) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；d) 如您出现违反中国有关法律、法规或者新易陶app服务协议或相关规则的情况，需要向第三方披露；\ne) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷； \n f)  其它\n新易陶app根据法律、法规或者网站政策认为合适的披露。\n 4. 信息存储和交换\n新易陶app收集的有关您的信息和资料将保存在新易陶app及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或新易陶app收集信息和资料所在地的境外并在境外被访问、存储和展示。\n5. 信息安全\na) 新易陶app帐号均有安全保护功能，请妥善保管您的用户名及密码信息。新易陶app将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。   b) 如您发现自己的个人信息泄密，尤其是新易陶app用户名及密码发生泄露，请您立即联络新易陶app客服，以便新易陶app采取相应措施"
@interface UserProtocolVC ()

@property (weak, nonatomic) IBOutlet NSLayoutConstraint *scrollViewH;
@property (weak, nonatomic) IBOutlet UILabel *contentLbl;
@property (nonatomic,assign) ProtocolType type;
@end

@implementation UserProtocolVC
- (instancetype)initWithType:(ProtocolType)type{
	self = [super init];
	if (self) {
		_type = type;
	}
	return self;
}
- (void)viewDidLoad {
    [super viewDidLoad];
	NSString *content = ProtocolTypePrivacyContent;
		self.title = @"隐私政策";
	if (_type == ProtocolTypeUse) {
		self.title = @"新易陶用户使用协议";
		content = UserProtocolUseContent;
	}
	[self setContent:content];
}
-(void)setContent:(NSString * )content{
	_contentLbl.text = content;
	
	 _scrollViewH.constant = [DDFactory autoHByText:content Font:[UIFont fontWithName:@"PingFang-SC-Medium" size:14] W:SCREENWIDTH - 10] + 20;
}

- (void)didReceiveMemoryWarning {
    [super didReceiveMemoryWarning];
    // Dispose of any resources that can be recreated.
}
@end
